Lyapunov_exponents_twoSquareCylinders/0/U_d
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U_d;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
84253
(
(0.000878115 -1.74917e-08 0)
(0.000878095 -6.14067e-08 0)
(0.0008781 -1.03789e-07 0)
(0.000878108 -1.40382e-07 0)
(0.0008781 -1.67714e-07 0)
(0.000878103 -1.97311e-07 0)
(0.00087811 -2.18317e-07 0)
(0.000878108 -2.38448e-07 0)
...
)
;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    OUTLET
    {
        type            zeroGradient;
    }
    SYMMETRY
    {
        type            symmetry;
    }
    SQUARE_UP
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    SQUARE_DOWN
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
