Lyapunov_exponents_twoSquareCylinders/0/U_d2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U_d2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
84253
(
(0.000844382 -2.64733e-08 0)
(0.000844359 -1.33369e-07 0)
(0.000844365 -2.38854e-07 0)
(0.00084437 -3.2337e-07 0)
(0.000844369 -4.0293e-07 0)
(0.000844369 -4.76516e-07 0)
(0.000844378 -5.41432e-07 0)
(0.000844377 -6.01975e-07 0)
...
)
;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    OUTLET
    {
        type            zeroGradient;
    }
    SYMMETRY
    {
        type            symmetry;
    }
    SQUARE_UP
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    SQUARE_DOWN
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
