Lyapunov_exponents_twoSquareCylinders/0/U_d4
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U_d4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
84253
(
(0.000888571 -1.01298e-08 0)
(0.000888559 -2.23446e-08 0)
(0.000888563 -3.20597e-08 0)
(0.000888567 -4.86522e-08 0)
(0.00088856 -6.40772e-08 0)
(0.00088856 -8.98834e-08 0)
(0.000888566 -1.17405e-07 0)
(0.000888566 -1.52843e-07 0)
...
)
;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    OUTLET
    {
        type            zeroGradient;
    }
    SYMMETRY
    {
        type            symmetry;
    }
    SQUARE_UP
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    SQUARE_DOWN
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
