Lyapunov_exponents_twoSquareCylinders/0/U_d5
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U_d5;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
84253
(
(0.000992889 -3.36556e-08 0)
(0.00099288 -1.46439e-07 0)
(0.00099288 -2.57791e-07 0)
(0.000992889 -3.58634e-07 0)
(0.000992879 -4.54368e-07 0)
(0.000992879 -5.50715e-07 0)
(0.000992889 -6.38987e-07 0)
(0.000992889 -7.28456e-07 0)
...
)
;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    OUTLET
    {
        type            zeroGradient;
    }
    SYMMETRY
    {
        type            symmetry;
    }
    SQUARE_UP
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    SQUARE_DOWN
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
