Lyapunov_exponents_twoSquareCylinders/0/U_d6
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U_d6;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
84253
(
(0.00102173 -2.74624e-08 0)
(0.00102172 -1.21417e-07 0)
(0.00102172 -2.16161e-07 0)
(0.00102173 -3.00443e-07 0)
(0.00102172 -3.85029e-07 0)
(0.00102172 -4.74624e-07 0)
(0.00102173 -5.63735e-07 0)
(0.00102173 -6.5823e-07 0)
...
)
;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    OUTLET
    {
        type            zeroGradient;
    }
    SYMMETRY
    {
        type            symmetry;
    }
    SQUARE_UP
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    SQUARE_DOWN
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
