Lyapunov_exponents_twoSquareCylinders/0/p_d5
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_d5;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
84253
(
-0.0114201
-0.0114227
-0.0114276
-0.0114348
-0.011444
-0.011455
-0.0114678
-0.0114821
...
)
;

boundaryField
{
    INLET
    {
        type            zeroGradient;
    }
    OUTLET
    {
        type            fixedValue;
        value           uniform 0;
    }
    SYMMETRY
    {
        type            symmetry;
    }
    SQUARE_UP
    {
        type            zeroGradient;
    }
    SQUARE_DOWN
    {
        type            zeroGradient;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
