Lyapunov_exponents_twoSquareCylinders/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;


vertices
(
    (0 0 0)
    (6.2831853071795865 0 0)
    (6.2831853071795865 6.2831853071795865 0)
    (0 6.2831853071795865 0)
    (0 0 0.1)
    (6.2831853071795865 0 0.1)
    (6.2831853071795865 6.2831853071795865 0.1)
    (0 6.2831853071795865 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (32 32 1) simpleGrading (1 1 1)
);

boundary
(
    upperWall
    {
        type cyclic;
        neighbourPatch lowerWall;
        faces
        (
            (3 7 6 2)
        );
    }
    lowerWall
    {
        type cyclic;
        neighbourPatch upperWall;
        faces        
        (
             (1 5 4 0)
        );
    }
    leftWall
    {
        type cyclic;
        neighbourPatch rightWall;
        faces
        (
            (0 4 7 3)
        );
    }
    rightWall
    {
        type cyclic;
        neighbourPatch leftWall;
        faces
        (
            (2 6 5 1)
        );
    }    
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
